tutorials/multiphase/interFoam/laminar/waves/waveMakerMultiPaddlePiston/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftwall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    back
    {
        type            slip;
    }

    front
    {
        type            slip;
    }

    rightwall
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }

    top
    {
          type          pressureInletOutletVelocity;
          value         uniform (0 0 0);
    }
}


// ************************************************************************* //
